### Terraform Plan Output for `stage-team-account/state/S3`
```hcl
[command]/home/runner/work/_temp/cfe182a9-0de2-4caa-9f21-a9c5ae926eb8/terraform-bin show -no-color tfplan.binary

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_key.s3_key will be created
  + resource "aws_kms_key" "s3_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for S3 encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::929368846645:root"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowRootAccountFullAccess"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:DescribeKey",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceAccount" = "929368846645"
                              + "aws:SourceArn"     = "arn:aws:s3:::cloudfence-stage-state"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowS3ServicePrincipal"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "ap-northeast-2"
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # aws_s3_bucket.state_org will be created
  + resource "aws_s3_bucket" "state_org" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "cloudfence-stage-state"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "stage"
          + "Name"        = "Terraform State Bucket"
        }
      + tags_all                    = {
          + "Environment" = "stage"
          + "Name"        = "Terraform State Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_ownership_controls.ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "ownership" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-northeast-2"

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # aws_s3_bucket_public_access_block.state_org_block will be created
  + resource "aws_s3_bucket_public_access_block" "state_org_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ap-northeast-2"
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-northeast-2"

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.state_org_versioning will be created
  + resource "aws_s3_bucket_versioning" "state_org_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-northeast-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_kms_key.s3_key will be created%0A  + resource "aws_kms_key" "s3_key" {%0A      + arn                                = (known after apply)%0A      + bypass_policy_lockout_safety_check = false%0A      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"%0A      + description                        = "KMS key for S3 encryption"%0A      + enable_key_rotation                = true%0A      + id                                 = (known after apply)%0A      + is_enabled                         = true%0A      + key_id                             = (known after apply)%0A      + key_usage                          = "ENCRYPT_DECRYPT"%0A      + multi_region                       = (known after apply)%0A      + policy                             = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "kms:*"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::929368846645:root"%0A                        }%0A                      + Resource  = "*"%0A                      + Sid       = "AllowRootAccountFullAccess"%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "kms:Encrypt",%0A                          + "kms:Decrypt",%0A                          + "kms:ReEncrypt*",%0A                          + "kms:GenerateDataKey*",%0A                          + "kms:DescribeKey",%0A                        ]%0A                      + Condition = {%0A                          + StringEquals = {%0A                              + "aws:SourceAccount" = "929368846645"%0A                              + "aws:SourceArn"     = "arn:aws:s3:::cloudfence-stage-state"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "s3.amazonaws.com"%0A                        }%0A                      + Resource  = "*"%0A                      + Sid       = "AllowS3ServicePrincipal"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + region                             = "ap-northeast-2"%0A      + rotation_period_in_days            = (known after apply)%0A      + tags_all                           = (known after apply)%0A    }%0A%0A  # aws_s3_bucket.state_org will be created%0A  + resource "aws_s3_bucket" "state_org" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "cloudfence-stage-state"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_region               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = "ap-northeast-2"%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "stage"%0A          + "Name"        = "Terraform State Bucket"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "stage"%0A          + "Name"        = "Terraform State Bucket"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # aws_s3_bucket_ownership_controls.ownership will be created%0A  + resource "aws_s3_bucket_ownership_controls" "ownership" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "ap-northeast-2"%0A%0A      + rule {%0A          + object_ownership = "ObjectWriter"%0A        }%0A    }%0A%0A  # aws_s3_bucket_public_access_block.state_org_block will be created%0A  + resource "aws_s3_bucket_public_access_block" "state_org_block" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + region                  = "ap-northeast-2"%0A      + restrict_public_buckets = true%0A    }%0A%0A  # aws_s3_bucket_server_side_encryption_configuration.encryption will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "encryption" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "ap-northeast-2"%0A%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + kms_master_key_id = (known after apply)%0A              + sse_algorithm     = "aws:kms"%0A            }%0A        }%0A    }%0A%0A  # aws_s3_bucket_versioning.state_org_versioning will be created%0A  + resource "aws_s3_bucket_versioning" "state_org_versioning" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "ap-northeast-2"%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0APlan: 6 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_kms_key.s3_key will be created%0A  + resource "aws_kms_key" "s3_key" {%0A      + arn                                = (known after apply)%0A      + bypass_policy_lockout_safety_check = false%0A      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"%0A      + description                        = "KMS key for S3 encryption"%0A      + enable_key_rotation                = true%0A      + id                                 = (known after apply)%0A      + is_enabled                         = true%0A      + key_id                             = (known after apply)%0A      + key_usage                          = "ENCRYPT_DECRYPT"%0A      + multi_region                       = (known after apply)%0A      + policy                             = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "kms:*"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::929368846645:root"%0A                        }%0A                      + Resource  = "*"%0A                      + Sid       = "AllowRootAccountFullAccess"%0A                    },%0A                  + {%0A                      + Action    = [%0A                          + "kms:Encrypt",%0A                          + "kms:Decrypt",%0A                          + "kms:ReEncrypt*",%0A                          + "kms:GenerateDataKey*",%0A                          + "kms:DescribeKey",%0A                        ]%0A                      + Condition = {%0A                          + StringEquals = {%0A                              + "aws:SourceAccount" = "929368846645"%0A                              + "aws:SourceArn"     = "arn:aws:s3:::cloudfence-stage-state"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "s3.amazonaws.com"%0A                        }%0A                      + Resource  = "*"%0A                      + Sid       = "AllowS3ServicePrincipal"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + region                             = "ap-northeast-2"%0A      + rotation_period_in_days            = (known after apply)%0A      + tags_all                           = (known after apply)%0A    }%0A%0A  # aws_s3_bucket.state_org will be created%0A  + resource "aws_s3_bucket" "state_org" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "cloudfence-stage-state"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_region               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = "ap-northeast-2"%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "stage"%0A          + "Name"        = "Terraform State Bucket"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "stage"%0A          + "Name"        = "Terraform State Bucket"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # aws_s3_bucket_ownership_controls.ownership will be created%0A  + resource "aws_s3_bucket_ownership_controls" "ownership" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "ap-northeast-2"%0A%0A      + rule {%0A          + object_ownership = "ObjectWriter"%0A        }%0A    }%0A%0A  # aws_s3_bucket_public_access_block.state_org_block will be created%0A  + resource "aws_s3_bucket_public_access_block" "state_org_block" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + region                  = "ap-northeast-2"%0A      + restrict_public_buckets = true%0A    }%0A%0A  # aws_s3_bucket_server_side_encryption_configuration.encryption will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "encryption" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "ap-northeast-2"%0A%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + kms_master_key_id = (known after apply)%0A              + sse_algorithm     = "aws:kms"%0A            }%0A        }%0A    }%0A%0A  # aws_s3_bucket_versioning.state_org_versioning will be created%0A  + resource "aws_s3_bucket_versioning" "state_org_versioning" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "ap-northeast-2"%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0APlan: 6 to add, 0 to change, 0 to destroy.%0A

::set-output name=stderr::

::set-output name=exitcode::0
```